#!/usr/bin/env python
# -*- coding: UTF-8 -*-

# 入参
brand_name = ''

# start
brand_dict = {
    '丰田塞纳': '丰田-日系-塞纳',
    '丰田PRADO 2.8L': '丰田-日系-普拉多',
    '丰田塞纳 XLE': '丰田-日系-塞纳',
    '丰田GRANVIA': '丰田-日系-其他',
    '丰田FORTUNER': '丰田-日系-Fortuner',
    '丰田HILUX': '丰田-日系-海拉克斯',
    '丰田 坦途': '丰田-日系-坦途',
    '宾利飞驰': '宾利-英系-飞驰',
    '宾利添越': '宾利-英系-添越',
    '宾利GT': '宾利-英系-欧陆GT',
    '奔驰GLE450': '奔驰-德系-GLE级',
    '奔驰GLE53': '奔驰-德系-GLE级',
    '奔驰V250': '奔驰-德系-V级',
    '奔驰GLE63': '奔驰-德系-GLE级',
    '奔驰S450': '奔驰-德系-S级',
    '奔驰G500': '奔驰-德系-G级',
    '奔驰G63': '奔驰-德系-G级',
    '奔驰GLS450': '奔驰-德系-GLS级',
    '宝马X5 45E': '宝马-德系-X5',
    '宝马X5': '宝马-德系-X5',
    '保时捷卡宴': '保时捷-德系-Cayenne',
    '雷克萨斯ES250': '雷克萨斯-日系-ES',
    '雷克萨斯LX600': '雷克萨斯-日系-LX',
    '雷萨 GX460': '雷克萨斯-日系-GX',
    '福特LOBO': '福特-美系-F150',
    '福特烈马': '福特-美系-野马',
    '铃木Jimny': '铃木-日系-吉姆尼',
    '铃木Jimny MT': '铃木-日系-吉姆尼',
    '铃木Jimny AT': '铃木-日系-吉姆尼',
    '雪佛兰CHEYENNE ZR2': '雪佛兰-美系-其他',
    'RAM 1500': '道奇-美系-公羊'
}

print('型号：' + brand_name)
brand_name = brand_dict.get(brand_name, brand_name[:2])
print('对应品牌：' + brand_name)
# end
