#!/usr/bin/env python
# -*- coding: UTF-8 -*-

# 入参
data_dict = {'51751 补税.xlsx': {'车架号': {0: 'W1NYC6BJ1LX351751'}, '开证银行': {0: '招商汽贸民生'}, '合同号': {0: 'SY2010074'}, '车型': {0: 'MERCEDES Benz G550'}, '贵司合同号': {0: '200585QMJK87TY0412LC'}, '报关单号': {0: 20820211000020539}, '总税款': {0: 95938.3}, '保证金': {0: None}, '垫税金额': {0: None}, '交税日期': {0: '2022-08-24'}}, '6.xlsx': {'车架号': {0: '4JGFF5KE6MA378950'}, '开证银行': {0: None}, '合同号': {0: 'SY2107B007'}, '车型': {0: None}, '贵司合同号': {0: '210175QMJK87TY0304LC'}, '报关单号': {0: 20820211000032591}, '总税款': {0: 303227}, '保证金': {0: None}, '垫税金额': {0: None}, '交税日期': {0: '2022-12-09'}}, '7.xlsx': {'车架号': {0: '4JGFF5KE6MA378950', 1: '4JGFF5KE6MA378951', 2: '4JGFF5KE6MA378952', 3: '4JGFF5KE6MA378953', 4: '4JGFF5KE6MA378954'}, '开证银行': {0: None, 1: None, 2: None, 3: None, 4: None}, '合同号': {0: 'SY2107B007', 1: 'SY2107B008', 2: 'SY2107B009', 3: 'SY2107B010', 4: 'SY2107B011'}, '车型': {0: None, 1: None, 2: None, 3: None, 4: None}, '贵司合同号': {0: '210175QMJK87TY0304LC', 1: '210175QMJK87TY0305LC', 2: '210175QMJK87TY0306LC', 3: '210175QMJK87TY0307LC', 4: '210175QMJK87TY0308LC'}, '报关单号': {0: 20820211000032591, 1: 20820211000032591, 2: 20820211000032591, 3: 20820211000032591, 4: 20820211000032591}, '总税款': {0: 303227, 1: 303228, 2: 303229, 3: 303230, 4: 303231}, '保证金': {0: None, 1: None, 2: None, 3: None, 4: None}, '垫税金额': {0: None, 1: None, 2: None, 3: None, 4: None}, '交税日期': {0: '2022-12-09', 1: '2022-12-10', 2: '2022-12-11', 3: '2022-12-12', 4: '2022-12-13'}}, '8.xlsx': {'车架号': {0: '4JGFF5KE3432340'}, '开证银行': {0: None}, '合同号': {0: 'SY2107B007'}, '车型': {0: None}, '贵司合同号': {0: '210175QMJK87TY0304LC'}, '报关单号': {0: 20820211000032591}, '总税款': {0: 303227}, '保证金': {0: None}, '垫税金额': {0: None}, '交税日期': {0: '2022-12-09'}}}
# start

customs_no_dict = {}

for data in data_dict:
    table = data_dict.get(data)
    numbers = table.get('报关单号')
    for n_key in numbers:
        customs_no_dict.setdefault(numbers.get(n_key), 0)

# end
print(customs_no_dict)
